; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_9 ?v1 ?v2)
             (pred_6 ?v10 ?v4)
             (pred_4 ?v1 ?v4)
             (pred_8 ?v7 ?v1 )
	     (pred_1 ?v1)
             (pred_5 ?v8)
             (pred_2 ?v10)
             (pred_12 ?v4)
             (pred_11 ?v1)
             (pred_7 ?v10)
             (pred_10 ?v1)
             (pred_3 ))



(:action op_4
:parameters (?v13 ?v3 ?v9 ?v6)
:precondition (and (pred_5 ?v13) (pred_5 ?v3) (pred_2 ?v9) (pred_12 ?v6)
          (pred_9 ?v13 ?v3) (pred_6 ?v9 ?v6)
                   (pred_4 ?v3 ?v6) (pred_1 ?v13) 
                   (pred_11 ?v3) (pred_7 ?v9))
:effect (and  (pred_10 ?v3) (not (pred_11 ?v3))))


(:action op_3
:parameters (?v13 ?v5)
:precondition (and (pred_5 ?v13) (pred_5 ?v5)
               (pred_1 ?v13) (pred_9 ?v13 ?v5) (pred_10 ?v5))
:effect (and (pred_1 ?v5) (not (pred_1 ?v13))))

(:action op_2
:parameters (?v13 ?v9)
:precondition (and (pred_5 ?v13) (pred_2 ?v9) 
                  (pred_1 ?v13) (pred_8 ?v9 ?v13) (pred_3 ))
:effect (and (pred_7 ?v9)
   (not (pred_8 ?v9 ?v13)) (not (pred_3 ))))


(:action op_1
:parameters (?v13 ?v11 ?v12)
:precondition (and (pred_5 ?v13) (pred_2 ?v11) (pred_2 ?v12)
                  (pred_1 ?v13) (pred_7 ?v12) (pred_8 ?v11 ?v13))
:effect (and (pred_7 ?v11) (pred_8 ?v12 ?v13)
        (not (pred_7 ?v12)) (not (pred_8 ?v11 ?v13))))

(:action op_5
:parameters (?v13 ?v9)
:precondition (and (pred_5 ?v13) (pred_2 ?v9) 
                  (pred_1 ?v13) (pred_7 ?v9))
:effect (and (pred_3 ) (pred_8 ?v9 ?v13) (not (pred_7 ?v9)))))

; problem
(define (problem grid-5-5-3-4-4)
    (:domain grid)
    (:objects
    obj_05 obj_27 obj_18 obj_01 obj_28 obj_26 obj_06 obj_14 obj_10 obj_03 obj_16 obj_32 obj_30 obj_17 obj_21 obj_22 obj_25 obj_19 obj_20 obj_08 obj_02 obj_04 obj_07 obj_24 obj_13
    obj_09 obj_31 obj_29
    obj_11 obj_12 obj_15 obj_23
    )

    (:init
       (pred_3)

       (pred_5 obj_05)
       (pred_5 obj_27)
       (pred_5 obj_18)
       (pred_5 obj_01)
       (pred_5 obj_28)
       (pred_5 obj_26)
       (pred_5 obj_06)
       (pred_5 obj_14)
       (pred_5 obj_10)
       (pred_5 obj_03)
       (pred_5 obj_16)
       (pred_5 obj_32)
       (pred_5 obj_30)
       (pred_5 obj_17)
       (pred_5 obj_21)
       (pred_5 obj_22)
       (pred_5 obj_25)
       (pred_5 obj_19)
       (pred_5 obj_20)
       (pred_5 obj_08)
       (pred_5 obj_02)
       (pred_5 obj_04)
       (pred_5 obj_07)
       (pred_5 obj_24)
       (pred_5 obj_13)
       (pred_12 obj_09)
       (pred_12 obj_31)
       (pred_12 obj_29)
       (pred_2 obj_11)
       (pred_2 obj_12)
       (pred_2 obj_15)
       (pred_2 obj_23)

       (pred_9 obj_05 obj_26)
       (pred_9 obj_05 obj_27)
       (pred_9 obj_27 obj_06)
       (pred_9 obj_27 obj_18)
       (pred_9 obj_27 obj_05)
       (pred_9 obj_18 obj_14)
       (pred_9 obj_18 obj_01)
       (pred_9 obj_18 obj_27)
       (pred_9 obj_01 obj_10)
       (pred_9 obj_01 obj_28)
       (pred_9 obj_01 obj_18)
       (pred_9 obj_28 obj_03)
       (pred_9 obj_28 obj_01)
       (pred_9 obj_26 obj_16)
       (pred_9 obj_26 obj_06)
       (pred_9 obj_26 obj_05)
       (pred_9 obj_06 obj_32)
       (pred_9 obj_06 obj_14)
       (pred_9 obj_06 obj_27)
       (pred_9 obj_06 obj_26)
       (pred_9 obj_14 obj_30)
       (pred_9 obj_14 obj_10)
       (pred_9 obj_14 obj_18)
       (pred_9 obj_14 obj_06)
       (pred_9 obj_10 obj_17)
       (pred_9 obj_10 obj_03)
       (pred_9 obj_10 obj_01)
       (pred_9 obj_10 obj_14)
       (pred_9 obj_03 obj_21)
       (pred_9 obj_03 obj_28)
       (pred_9 obj_03 obj_10)
       (pred_9 obj_16 obj_22)
       (pred_9 obj_16 obj_32)
       (pred_9 obj_16 obj_26)
       (pred_9 obj_32 obj_25)
       (pred_9 obj_32 obj_30)
       (pred_9 obj_32 obj_06)
       (pred_9 obj_32 obj_16)
       (pred_9 obj_30 obj_19)
       (pred_9 obj_30 obj_17)
       (pred_9 obj_30 obj_14)
       (pred_9 obj_30 obj_32)
       (pred_9 obj_17 obj_20)
       (pred_9 obj_17 obj_21)
       (pred_9 obj_17 obj_10)
       (pred_9 obj_17 obj_30)
       (pred_9 obj_21 obj_08)
       (pred_9 obj_21 obj_03)
       (pred_9 obj_21 obj_17)
       (pred_9 obj_22 obj_02)
       (pred_9 obj_22 obj_25)
       (pred_9 obj_22 obj_16)
       (pred_9 obj_25 obj_04)
       (pred_9 obj_25 obj_19)
       (pred_9 obj_25 obj_32)
       (pred_9 obj_25 obj_22)
       (pred_9 obj_19 obj_07)
       (pred_9 obj_19 obj_20)
       (pred_9 obj_19 obj_30)
       (pred_9 obj_19 obj_25)
       (pred_9 obj_20 obj_24)
       (pred_9 obj_20 obj_08)
       (pred_9 obj_20 obj_17)
       (pred_9 obj_20 obj_19)
       (pred_9 obj_08 obj_13)
       (pred_9 obj_08 obj_21)
       (pred_9 obj_08 obj_20)
       (pred_9 obj_02 obj_04)
       (pred_9 obj_02 obj_22)
       (pred_9 obj_04 obj_07)
       (pred_9 obj_04 obj_25)
       (pred_9 obj_04 obj_02)
       (pred_9 obj_07 obj_24)
       (pred_9 obj_07 obj_19)
       (pred_9 obj_07 obj_04)
       (pred_9 obj_24 obj_13)
       (pred_9 obj_24 obj_20)
       (pred_9 obj_24 obj_07)
       (pred_9 obj_13 obj_08)
       (pred_9 obj_13 obj_24)
       (pred_11 obj_13)
       (pred_11 obj_18)
       (pred_11 obj_28)
       (pred_11 obj_27)
       (pred_4  obj_13 obj_09)
       (pred_4  obj_18 obj_31)
       (pred_4  obj_28 obj_29)
       (pred_4  obj_27 obj_31)
       (pred_10 obj_05)
       (pred_10 obj_01)
       (pred_10 obj_26)
       (pred_10 obj_06)
       (pred_10 obj_14)
       (pred_10 obj_10)
       (pred_10 obj_03)
       (pred_10 obj_16)
       (pred_10 obj_32)
       (pred_10 obj_30)
       (pred_10 obj_17)
       (pred_10 obj_21)
       (pred_10 obj_22)
       (pred_10 obj_25)
       (pred_10 obj_19)
       (pred_10 obj_20)
       (pred_10 obj_08)
       (pred_10 obj_02)
       (pred_10 obj_04)
       (pred_10 obj_07)
       (pred_10 obj_24)

       (pred_6  obj_11 obj_09)
       (pred_6  obj_12 obj_31)
       (pred_6  obj_15 obj_29)
       (pred_6  obj_23 obj_31)
       (pred_8 obj_11 obj_25)
       (pred_8 obj_12 obj_17)
       (pred_8 obj_15 obj_21)
       (pred_8 obj_23 obj_26)
       (pred_1 obj_20)
    )

    (:goal (and
       (pred_8 obj_23 obj_17)
    ))
(:constraints
  (always (not (pred_1 obj_06)))
)
)

; plan
1. (op_3 obj_20 obj_17)
   deleted: (pred_1 obj_20)
   added: (pred_1 obj_17)
   goals met: 0 of 1
2. (op_3 obj_17 obj_30)
   deleted: (pred_1 obj_17)
   added: (pred_1 obj_30)
   goals met: 0 of 1
3. (op_3 obj_30 obj_32)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_32)
   goals met: 0 of 1
4. (op_3 obj_32 obj_16)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_16)
   goals met: 0 of 1
5. (op_3 obj_16 obj_26)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_26)
   goals met: 0 of 1
6. (op_2 obj_26 obj_23)
   deleted: (pred_8 obj_23 obj_26) (pred_3)
   added: (pred_7 obj_23)
   goals met: 0 of 1
7. (op_3 obj_26 obj_16)
   deleted: (pred_1 obj_26)
   added: (pred_1 obj_16)
   goals met: 0 of 1
8. (op_3 obj_16 obj_32)
   deleted: (pred_1 obj_16)
   added: (pred_1 obj_32)
   goals met: 0 of 1
9. (op_3 obj_32 obj_30)
   deleted: (pred_1 obj_32)
   added: (pred_1 obj_30)
   goals met: 0 of 1
10. (op_3 obj_30 obj_17)
   deleted: (pred_1 obj_30)
   added: (pred_1 obj_17)
   goals met: 0 of 1
11. (op_1 obj_17 obj_12 obj_23)
   deleted: (pred_7 obj_23) (pred_8 obj_12 obj_17)
   added: (pred_7 obj_12) (pred_8 obj_23 obj_17)
   goals met: 1 of 1
